''' 
Задание: 
Вам доступен текстовый файл pythonzen.txt, содержащий текст на английском языке:

The Zen of Python, by Tim Peters

Beautiful is better than ugly.
Explicit is better than implicit.
...
Напишите программу, которая определяет, сколько раз встречается каждая буква в этом тексте. 
Буквы и их количество должны выводиться в лексикографическом порядке, каждая на отдельной строке, в следующем формате:
	<буква>: <количество>
Примечание 1. Начальная часть ответа выглядит так:
a: 53
b: 21
...
Примечание 2. Программа не должна учитывать регистр, то есть, например, буквы a и A считаются одинаковыми.
Примечание 3. Программа должна игнорировать все небуквенные символы.

От: 27 ноября 2023 г.
'''

from collections import Counter

def format_line(line):
    return [x.lower() for x in line.strip() if x.isalpha()]
      

with open('pythonzen.txt', encoding='utf-8') as file:
    result = Counter(format_line(file.readline()))
    for line in file:
        result.update(format_line(line))

for elem in sorted(result):
    print(f'{elem}: {result[elem]}')