''' 
Задание: 
Дана последовательность слов. 
Напишите программу, которая выводит наиболее часто встречаемое слово в этой последовательности. 
Если таких слов несколько, программа должна вывести то, которое больше в лексикографическом сравнении.

Формат входных данных
На вход программе подается последовательность слов, разделенных пробелом.

Формат выходных данных
Программа должна определить наиболее часто встречаемое слово в введенной строке и вывести его в нижнем регистре. 
Если таких слов несколько, программа должна вывести то, которое больше в лексикографическом сравнении, также в нижнем регистре.

Примечание 1. Программа должна игнорировать регистр. То есть, например, слова Python и python считаются одинаковыми.

От: 29 ноября 2023 г.
'''

from collections import Counter

data = Counter([x.lower() for x in input().split()])
max_elem = data.most_common(1)[0][1]
result = sorted([key for key, value in data.items() if value == max_elem])
print(max(result))