''' 
Задание: 
Дана последовательность слов. Напишите программу, которая выводит наименее часто встречаемое слово в этой последовательности. 
Если таких слов несколько, программа должна вывести их все.

Формат входных данных
На вход программе подается последовательность слов, разделенных пробелом.

Формат выходных данных
Программа должна определить наименее часто встречаемое слово в введенной последовательности и вывести его в нижнем регистре. 
Если таких слов несколько, программа должна вывести их все в лексикографическом порядке, в нижнем регистре, разделяя запятой и пробелом.

Примечание 1. Программа должна игнорировать регистр. То есть, например, слова Python и python считаются одинаковыми.

От: 29 ноября 2023 г.
'''

from collections import Counter

data = Counter([x.lower() for x in input().split()])
filter_data = list(filter(lambda item: item[1] == min(data.values()), data.items()))
result = [elem[0] for elem in sorted(filter_data, key= lambda x: x[0])]
print(', '.join(result))