''' 
Задание: 
Дан список имен учеников и их оценок за экзамен. 
Напишите программу, которая определяет второго по счету ученика, имеющего самую низкую оценку.

Формат входных данных
На вход программе подается произвольное количество строк, в каждой из которых записаны имя очередного ученика и его оценка, разделенные пробелом.

Формат выходных данных
Программа должна определить второго по счету ученика, который имеет самую низкую оценку, и вывести его имя.

Примечание 1. Гарантируется, что все ученики имеют различные имена и оценки.

От: 29 ноября 2023 г.
'''

import sys
from collections import Counter

data =  Counter({line.strip().split()[0]:int(line.strip().split()[1]) for line in sys.stdin})
print(data.most_common()[::-1][1][0])