''' 
Задание: 
Тимур составляет список покупок, но так как на его клавиатуре перестал работать блок с цифрами, то вместо указания количества товара числом, он добавляет его в список столько раз, сколько планирует купить. 
Все товары Тимур записывает в нижнем регистре через запятую.
Напишите программу, которая выводит все товары из данного списка покупок, указывая для каждого его количество.

Формат входных данных
На вход программе подается последовательность товаров, разделенных запятой без пробелов.

Формат выходных данных
Программа должны вывести все введенные товары, указывая для каждого, сколько раз он встречается в данной последовательности. 
Товары должны быть расположены в лексикографическом порядке, каждый на отдельной строке, в следующем формате:
	<товар>: <количество>

От: 24 ноября 2023 г.
'''

from collections import Counter

list_buy = Counter(input().split(','))
for buy in sorted(list_buy):
      print(f'{buy}: {list_buy[buy]}')