''' 
Задание: 
Команда BEEGEEK планирует выпустить свой новый курс 08.11.2022 ровно в 12:00. 
Напишите программу, которая принимает на вход текущие дату и время и определяет, сколько времени осталось до выхода курса.

Формат входных данных
На вход программе подаются текущие дата и время в формате DD.MM.YYYY HH:MM.

Формат выходных данных
Программа должна вывести текст с указанием количества дней и часов, оставшихся до выхода курса, в следующем формате:

До выхода курса осталось: <кол-во дней> дней и <кол-во часов> часов
Если в данном случае количество часов равно нулю, то вывести нужно только дни.
Если количество дней равно нулю, то вывести нужно только часы и минуты в следующем формате:
До выхода курса осталось: <кол-во часов> часов и <кол-во минут> минут
Если в данном случае количество минут равно нулю, то вывести нужно только часы. Аналогично, если количество часов равно нулю, то вывести нужно только минуты.
Если введенные дата и время больше либо равны 08.11.2022 12:00, программа должна вывести текст: 

Курс уже вышел!

От: 23 октября 2023 г. в 17:15
'''

from datetime import timedelta, datetime

def choose_plural(amount, declensions):
    decl_word = {1: [1], 2: [2, 3, 4], 3: [5, 6, 7, 8, 9, 0]}
    decl_amount = amount % 10
    for key, value in decl_word.items():
        if (amount % 100) in [11, 12, 13, 14]:
            return f'{amount} {declensions[2]}'
        elif decl_amount in value:
            return f'{amount} {declensions[key - 1]}'

declensions = [("день", "дня", "дней"), ("час", "часа", "часов"), ("минута", "минуты", "минут")]
input_date = datetime.strptime(input(), '%d.%m.%Y %H:%M')
release_date = datetime.strptime('08.11.2022 12:00', '%d.%m.%Y %H:%M')

if input_date >= release_date:
    print('Курс уже вышел!')
else:
    list_date = []
    diff_date = release_date - input_date
    diff_date = [diff_date.days, diff_date.seconds // 3600, (diff_date.seconds // 60) % 60]
    res, count = '', 0
    for i in range(3):
        if diff_date[i] != 0:
            if res == '':
                count += 1
                res += choose_plural(diff_date[i], declensions[i])
            else:
                count += 1
                if count != 3:
                    res += ' и ' + choose_plural(diff_date[i], declensions[i])
    
    result = 'До выхода курса осталось: '
    result += res
    print(result)











































