''' 
Задание: 
Артуру нужно подготовить 10 задач для нового курса "ООП на Python". Чтобы занятие не оказалось утомительным, он придумал правило:
	если сегодня он подготовил первую задачу, то вторую он должен подготовить через один день
	если сегодня он подготовил вторую задачу, то третью он должен подготовить через два дня
	если сегодня он подготовил третью задачу, то четвертую он должен подготовить через три дня
	и так далее
Напишите программу, которая определяет даты, в которые Артуру нужно подготовить задачи.

Формат входных данных
На вход программе подается дата подготовки первой задачи в формате DD.MM.YYYY.

Формат выходных данных
Программа должна вывести 10 дат, удовлетворяющих условию задачи, каждую на отдельной строке, в формате DD.MM.YYYY.

От: 10 октября 2023 г. в 16:22
'''

from datetime import datetime, timedelta

input_date = input()
date = datetime.strptime(input_date, '%d.%m.%Y')
print(date.strftime('%d.%m.%Y'))
count_task, count_day = 1, 2

while count_task != 10:
    date += timedelta(days= (count_day))
    print(date.strftime('%d.%m.%Y'))
    count_task += 1
    count_day += 1
    
   











































