''' 
Задание: 
Репетитор по математике проводит занятия по 45 минут с перерывами по 10 минут. 
Репетитор обозначает время начала рабочего дня и время окончания рабочего дня. 
Напишите программу, которая генерирует и выводит расписание занятий.

Формат входных данных
На вход программе в первой строке подается время начала рабочего дня в формате HH:MM. 
В следующей строке вводится время окончания рабочего дня в том же формате.

Формат выходных данных
Программа должна сгенерировать и вывести расписание занятий. 
На первой строке выводится время начала и окончания первого занятия в формате HH:MM - HH:MM, на второй строке — время начала и окончания второго занятия в том же формате, и так далее.

Примечание 1. Если занятие обрывается временем окончания работы, то добавлять его в расписание не нужно.
Примечание 2. Если разница между временем начала и окончания рабочего дня меньше 45 минут, программа ничего не должна выводить.

От: 16 октября 2023 г. в 10:36
'''

from datetime import datetime, timedelta

date_start, date_end = datetime.strptime(input(), '%H:%M'), datetime.strptime(input(), '%H:%M')
compared_date = date_start
while compared_date < date_end:
    if compared_date + timedelta(minutes=45) <= date_end:
        print(f'{compared_date.strftime("%H:%M")} - {(compared_date + timedelta(minutes=45)).strftime("%H:%M")}')
        compared_date += timedelta(minutes=45)
    else:
        compared_date = date_end
    if compared_date + timedelta(minutes=10) <= date_end:
        compared_date += timedelta(minutes=10)
   











































