''' 
Задание: 
Дан список сотрудников организации, в котором указаны их фамилии, имена и даты рождения. Напишите программу, которая определяет самого старшего сотрудника из данного списка.

Формат входных данных
На вход программе в первой строке подается натуральное число n — количество сотрудников, работающих в организации. 
В последующих n строках вводятся данные о каждом сотруднике: имя, фамилия и дата рождения, разделённые пробелом. 
Дата рождения указывается в формате DD.MM.YYYY.

Формат выходных данных
Программа должна определить самого старшего сотрудника и вывести его дату рождения, имя и фамилию, разделив пробелом. 
Если таких сотрудников несколько, программа должна вывести их дату рождения, а также их количество, разделив пробелом.

Примечание 1. Гарантируется, что у всех сотрудников имена и фамилии различны.

От: 18 октября 2023 г. в 11:09
'''

from datetime import timedelta, datetime

employees = []
for i in range(int(input())):
    name, surname, birthday_day = input().split()
    employees.append((name, surname, datetime.strptime(birthday_day, '%d.%m.%Y')))

min_birthday = min(employees, key= lambda x:x[2])

count = 0
for i in range(len(employees)):
    count += employees[i].count(min_birthday[2])
    
if count > 1:
    print(min_birthday[2].strftime('%d.%m.%Y'), count)
else:
    print(min_birthday[2].strftime('%d.%m.%Y'), min_birthday[0], min_birthday[1]) 











































