''' 
Задание: 
Дан список сотрудников организации, в котором указаны их фамилии, имена и даты рождения. 
Напишите программу, которая определяет, в какую из дат родилось больше всего сотрудников.

Формат входных данных
На вход программе в первой строке подается натуральное число n — количество сотрудников, работающих в организации. 
В последующих n строках вводятся данные о каждом сотруднике: имя, фамилия и дата рождения, разделённые пробелом. 
Дата рождения указывается в формате DD.MM.YYYY.

Формат выходных данных
Программа должна вывести дату, в которую наибольшее количество сотрудников отмечает день рождения, в формате DD.MM.YYYY. 
Если таких дат несколько, программа должна вывести их все в порядке возрастания, каждую на отдельной строке, в том же формате.

От: 18 октября 2023 г. в 11:51
'''

from datetime import timedelta, datetime

employees = []
data_employees = {}
for i in range(int(input())):
    name, surname, birthday_day = input().split()
    employees.append((name, surname, datetime.strptime(birthday_day, '%d.%m.%Y')))
    data_employees[datetime.strptime(birthday_day, '%d.%m.%Y')] = data_employees.get(datetime.strptime(birthday_day, '%d.%m.%Y'), 0) + 1
    
sorted_data_employees = dict(sorted(data_employees.items()))
filter_key = sorted_data_employees[max(sorted_data_employees, key=sorted_data_employees.get)]
print_data = dict(filter(lambda item: item[1] == filter_key, sorted_data_employees.items()))
for key in print_data.keys():
    print(key.strftime('%d.%m.%Y'))
 











































