''' 
Задание: 
Во многих музеях существует один день месяца, когда посещение музея для всех лиц или отдельных категорий граждан происходит без взимания платы. 
Например, в Эрмитаже это третий четверг месяца.

Напишите программу, которая определяет даты бесплатных дней посещения Эрмитажа в заданном году.

Формат входных данных
На вход программе подается натуральное число, представляющее год.

Формат выходных данных
Программа должна определить все даты бесплатных дней посещения Эрмитажа в введенном году и вывести их. 
Даты должны быть расположены в порядке возрастания, каждая на отдельной строке, в формате DD.MM.YYYY.

От: 25 октября 2023 г. в 12:57
'''

import calendar
from datetime import datetime, date

monday_date, input_year = [], int(input())
for i in range(1, 13):
    month_calendar = calendar.monthcalendar(input_year, i)
    count = 0
    for j in range(len(month_calendar)):
        if month_calendar[j][3] != 0:
            count += 1
            if count == 3:
                print(datetime.strftime(datetime(input_year, i, month_calendar[j][3]), '%d.%m.%Y'))








































