''' 
Задание: 
Дана последовательность целых чисел. Напишите программу, которая определяет, является ли данная последовательность прогрессией, и если да, то определяет её вид.

Формат входных данных
На вход программе подается произвольное количество строк (не менее трёх), в каждой строке записано натуральное число — очередной член последовательности.

Формат выходных данных
Программа должна вывести текст:
	Арифметическая прогрессия, если введенная последовательность чисел является арифметической прогрессией
	Геометрическая прогрессия, если введенная последовательность чисел является геометрической прогрессией
	Не прогрессия, если введенная последовательность чисел не является прогрессией
Примечание 1. Гарантируется, что вид прогрессии определяется однозначно.

От: 26 октября 2023 г. в 17:05
'''

import sys
from datetime import datetime

date = [int(line.strip()) for line in sys.stdin]
d1, d2 = date[1] - date[0], date[1] // date[0]
geomtry, elem  = [], date[0]
for i in range(len(date)):
    geomtry.append(elem)
    elem *= d2
    
if date == [i for i in range(date[0], date[-1] + 1, d1)]:
    print('Арифметическая прогрессия')
elif date == geomtry:
    print('Геометрическая прогрессия')
else:
    print('Не прогрессия')





































