''' 
Задание: 
Напишите программу, которая принимает произвольное количество строк и в каждой введенной строке располагает все символы в обратном порядке.

Формат входных данных
На вход программе подается произвольное количество строк.

Формат выходных данных
Программа должна вывести все введенные строки, предварительно расположив в каждой строке все символы в обратном порядке.

Примечание 1. Порядок вывода строк должен совпадать с порядком их ввода.
Примечание 2. Если на вход программе ничего не подается, то она ничего не должна выводить.

От: 25 октября 2023 г. в 13:15
'''

import sys

for line in sys.stdin:
    print((line.strip('\n'))[::-1])









































