''' 
Задание: 
По чатам одного немалоизвестного мессенджера начали появляться новости сомнительного содержания. 
Оказалось, что некий молодежный клуб решил подшутить, распространяя всякие глупости. 
Однако подобное хулиганство мешает доверчивым людям, особенно пенсионного возраста, поэтому группа независимых программистов решила разработать бота, который мог бы оценить степень достоверности новости, а также отнести её к какой-либо категории.

Напишите программу, которая выводит все новости заданной категории, располагая их по возрастанию степени достоверности.

Формат входных данных
На вход программе подается произвольное количество строк, в каждой строке, кроме последней, записана новость, категория, к которой она относится, и ее достоверность в следующем формате:

<новость> / <категория> / <достоверность>
В последней строке подается одиночная категория.

Формат выходных данных
Программа должна вывести все новости, которые относятся к введенной категории. 
Новости должны быть расположены в порядке возрастания степени достоверности, а при совпадении степеней достоверности — в лексикографическом порядке самих новостей.

От: 26 октября 2023 г. в 16:03
'''

import sys

text = [line.split(' / ') for line in sys.stdin]
theme = text[-1][0]
text.remove(text[-1])
filter_theme = list(filter(lambda x: x[1] == theme, text))
for line in sorted(filter_theme, key= lambda x: (x[2], x[0])):
    print(line[0])







































