''' 
Задание: 
Дана последовательность дат. 
Напишите программу, которая выводит количество дней между максимальной и минимальной датами данной последовательности.

Формат входных данных
На вход программе подается произвольное количество строк, в каждой строке записана дата в ISO формате (YYYY-MM-DD).

Формат выходных данных
Программа должна вывести единственное число — количество дней между максимальной и минимальной датами введенной последовательности.

От: 26 октября 2023 г. в 14:48
'''

import sys
from datetime import datetime

data = [datetime.strptime(line.strip(), '%Y-%m-%d') for line in sys.stdin]
diff_data = max(data) - min(data)
print(diff_data.days)









































