''' 
Задание: 
Дана последовательность дат. 
Напишите программу, которая определяет, в каком порядке расположены даты в данной последовательности.

Формат входных данных
На вход программе подается произвольное количество строк (две или более), в каждой строке записана дата в формате DD.MM.YYYY.

Формат выходных данных
Программа должны вывести текст:
	ASC, если даты в введенной последовательности расположены строго в порядке возрастания
	DESC, если даты в введенной последовательности расположены строго в порядке убывания
	MIX, если даты в введенной последовательности расположены ни в порядке возрастания, ни в порядке убывания
Параметры ASC и DESC используются в языке SQL для сортировки по возрастанию и по убыванию соответственно.

От: 26 октября 2023 г. в 16:42
'''

import sys
from datetime import datetime

date = [datetime.strptime(line.strip(), "%d.%m.%Y") for line in sys.stdin]
if date == sorted(set(date)):
    print('ASC')
elif date == sorted(set(date), reverse=True):
    print('DESC')
else:
    print('MIX')






































