''' 
Задание: 
Вам доступен файл food_services.json, содержащий список JSON-объектов, которые представляют данные о заведениях общественного питания:

[
   {
      "Name": "СМЕТАНА",
      "IsNetObject": "нет",
      "OperatingCompany": "",
      "TypeObject": "кафе",
      "AdmArea": "Северо-Восточный административный округ",
      "District": "Ярославский район",
      "Address": "город Москва, улица Егора Абакумова, дом 9",
      "SeatsCount": 48
   },
   ...
]
Под «заведением» будем подразумевать один JSON-объект из этого списка. У заведения имеются следующие атрибуты:
	Name — название 
	IsNetObject — да\нет в зависимости от того, является ли заведение сетевым
	OperatingCompany — название сети
	TypeObject — вид (кафе, столовая, ресторан и т.д.)
	AdmArea — административная зона
	District — район
	Address — полный адрес
	SeatsCount — количество мест
Напишите программу, которая:
	определяет район Москвы, в котором находится больше всего заведений, и выводит название этого района и количество заведений в нем
	определяет сеть с самым большим числом заведений и выводит название этой сети и количество заведений этой сети
Полученные значения программа должна вывести в следующем формате:
	<район>: <количество заведений>
	<название сети>: <количество заведений>
Примечание 1. Гарантируется, что искомая сеть единственная.
Примечание 2. Пример вывода:
	район Метрогородок: 456
	Французская пекарня SeDelice: 144

От: 1 ноября 2023 г.
'''

import json, csv

with open('food_services.json', 'r', encoding='utf-8') as json_file:
    text = json.load(json_file)
  
    district = {}
    for t in text:
        district[t['District']] = district.get(t['District'], 0) + 1
    max_dist = max(district, key=district.get)
    print(f'{max_dist}: {district[max_dist]}')

    is_company = list(filter(lambda x: x['IsNetObject'] == 'да', text))
    num_company = {}
    for company in is_company:
        num_company[company['OperatingCompany']] = num_company.get(company['OperatingCompany'], 0) + 1
    max_num_company = max(num_company, key=num_company.get)
    print(f'{max_num_company}: {num_company[max_num_company]}')

      
      
      
      
      
      
      
      
  

  
  





































