''' 
Задание: 
Вам доступен файл food_services.json, содержащий список JSON-объектов, которые представляют данные о заведениях общественного питания:
[
   {
      "Name": "СМЕТАНА",
      "IsNetObject": "нет",
      "OperatingCompany": "",
      "TypeObject": "кафе",
      "AdmArea": "Северо-Восточный административный округ",
      "District": "Ярославский район",
      "Address": "город Москва, улица Егора Абакумова, дом 9",
      "SeatsCount": 48
   },
   ...
]
Под «заведением» будем подразумевать один JSON-объект из этого списка. 
У заведения имеются следующие атрибуты:
	Name — название 
	IsNetObject — да\нет в зависимости от того, является ли заведение сетевым
	OperatingCompany — название сети
	TypeObject — вид (кафе, столовая, ресторан и т.д.)
	AdmArea — административная зона
	District — район
	Address — полный адрес
	SeatsCount — количество посадочных мест
Напишите программу, которая определяет все виды заведений и для каждого вида находит самое большое заведение этого вида (имеет наибольшее количество посадочных мест). 
Программа должна вывести все виды заведений в лексикографическом порядке, указав для каждого самое большое заведение и количество посадочных мест в нем. 
Данные о заведениях должны быть расположены каждые на отдельной строке, в следующем формате:
	<вид заведения>: <название заведения>, <количество посадочных мест>

Примечание 1. Начальная часть ответа выглядит так:

бар: Барное объединение ПРОФСОЮЗ, 800
буфет: СТОЛОВАЯ - КАНТИНАСИТИ, 320
закусочная: Бургерная FARШ, 74
...

От: 1 ноября 2023 г.
'''

import json, csv

with open('food_services.json', 'r', encoding='utf-8') as json_file:
    text = json.load(json_file)
    objects = {}
    for t in text:
      if objects.get(t['TypeObject']) is None:
        type_filter = list(filter(lambda x: x['TypeObject'] == t['TypeObject'], text))
        max_type = max(type_filter, key=lambda x: x['SeatsCount'])
        objects[t['TypeObject']] = (max_type['Name'], max_type['SeatsCount'])

for type, (value1, value2) in sorted(objects.items()):
  print(f'{type}: {value1}, {value2}')
      
      
      
      
      
      
      
      
  

  
  





































