''' 
Задание: 
Вам доступен файл data.json, содержащий список различных объектов:

[
   "nwkWXma",
   null,
   {
      "ISgHT": "dIUbf"
   },
   "Pzt",
   "BXcbGVTE",
   ...
]
Напишите программу, которая создает список, элементами которого являются объекты из списка, содержащегося в файле data.json, измененные по следующим правилам:
	если объект является строкой, в его конец добавляется восклицательный знак
	если объект является числом, он увеличивается на единицу
	если объект является логическим значением, он инвертируется
	если объект является списком, он удваивается
	если объект является JSON-объектом (словарем), в него добавляется новая пара "newkey": null
	если объект является пустым значением (null), он не добавляется
Полученный список программа должна записать в файл updated_data.json.

Примечание 1. Например, если бы файл data.json имел вид:
	["Hello", 179, true, null, [1, 2, 3], {"key": "value"}]
то программа должна была бы создать файл updated_data.json со следующим содержанием:
	["Hello!", 180, false, [1, 2, 3, 1, 2, 3], {"key": "value", "newkey": null}]

От: 31 октября 2023 г.
'''

import json

with open('data.json', 'r', encoding='utf-8') as json_file, open('updated_data.json', 'w', encoding='utf-8') as updated_json_file:
  text = json.load(json_file)
  update_text = []
  for t in text:
    if type(t) == str:
      update_text.append(t + '!')
    elif type(t) == bool:
      update_text.append(not t)
    elif type(t) == int:
      update_text.append(t + 1)
    elif type(t) == list:
      update_text.append(t * 2)
    elif type(t) == dict:
      t['newkey'] = None
      update_text.append(t)
  print(json.dumps(update_text, indent=3), file=updated_json_file)


  
  





































