''' 
Задание: 
В онлайн-школе "BEEGEEK" сотрудникам положена корпоративная почта, которая формируется как <имя-фамилия>@beegeek.bzz, например, timyr-guev@beegeek.bzz. 
При таком подходе существует проблема тёзок. 
Для решения такой проблемы было решено приписывать справа номер.
Тогда первый Тимур Гуев получает ящик timyr-guev@beegeek.bzz (без номера), второй — timyr-guev1@beegeek.bzz, третий — timyr-guev2@beegeek.bzz, и так далее.
Вам дан список уже занятых ящиков в порядке их выдачи и имена-фамилии новых сотрудников в заранее подготовленном виде (латиницей с символом - между ними). 
Напишите программу, которая раздает корпоративные ящики новым сотрудникам школы.

Формат входных данных
На вход программе в первой строке подается целое неотрицательное число n — количество выданных ящиков. 
В следующих n строках перечислены сами ящики в порядке выдачи, по одному на строке. 
На следующей строке задано целое неотрицательное число m — количество новых сотрудников, которым нужно раздать корпоративные ящики. 
Каждая из последующих m строк представляет собой имя и фамилию сотрудника в подготовленном к использованию формате.

Формат выходных данных
Программа должна вывести почтовые ящики (m строк) для новых сотрудников в том порядке, в котором они раздавались.

От: 20 сентября 2023 г. в 13:06
'''

n = int(input())
name_email = []

for i in range(n):
    email = input().split('@')
    name_email.append(email[0])

m = int(input())
for i in range(m):
    input_email = input()
    if input_email in name_email:
        count, total = 0, 0
        while count != 1:
            total += 1
            new_email = input_email + str(total)
            if new_email not in name_email:
                print(new_email  + '@' + email[1])
                name_email.append(new_email)
                count += 1
    else:
        name_email.append(input_email)
        print(input_email + '@' + email[1])
    








    
   











































