''' 
Задание: 
Зачастую переводить сериалы, не теряя изначальный смысл, невозможно, особенно за счет игр слов. 
Сумасшедший режиссер хочет снять сериал, в котором бы в целях эксперимента задействовал как можно больше языков, чтобы пользоваться красотой каждого из них. Тем не менее если задействовать слишком много языков, то сериал станет непонятен абсолютно всем, поэтому режиссер достает случайных людей на улице и спрашивает их, какие языки они знают, таким образом он будет использовать языки которые знают все из них.
Напишите программу, которая определяет, какие языки будут использоваться в сериале.

Формат входных данных
На вход программе в первой строке подается число n — количество людей, которых донимает режиссер. 
В каждой из следующих n строк через запятую и пробел указывается список языков, которые знает человек.

Формат выходных данных
Программа должна вывести список языков для сериала в лексикографическом порядке. 
Если такой список составить нельзя, необходимо вывести текст: 
  Сериал снять не удастся

От: 18 сентября 2023 г. в 17:28
'''

n = int(input())
digital_sequence = {i : input().split(', ') for i in range(n)}
test = digital_sequence[0]
lang = []

for i in range(len(test)):
    count = 0
    for value in digital_sequence.values():
        if test[i] in value:
            count += 1
    if count == n:
        lang.append(test[i])

if lang:
    print(', '.join(sorted(lang)))
else:
    print('Сериал снять не удастся')
    








    
   











































