''' 
Задание: 
Реализуйте функцию print_given(), которая принимает произвольное количество позиционных и именованных аргументов и выводит все переданные аргументы, указывая тип каждого. Пары аргумент-тип должны выводиться каждая на отдельной строке, в следующем формате:

для позиционных аргументов:
  <значение аргумента> <тип аргумента>
для именованных аргументов:
  <имя переменной> <значение аргумента> <тип аргумента>

Входные данные: 

Выходные данные:

Примечание 1. При выводе позиционные аргументы должны быть расположены в порядке их передачи, именованные — в лексикографическом порядке имен переменных.
Примечание 2. При выводе сначала должны следовать все позиционные аргументы, затем — все именованные.
Примечание 3. Если в функцию ничего не передается, функция ничего не должна выводить.

От: 13 сентября 2023 г. в 10:46
'''

def print_given(*args, **kwargs):
    for i in range(len(args)):
        print(args[i], type(args[i]))
    for key, value in sorted(kwargs.items()):
        print(f'{key} {value} {type(value)}')




    








    
   











































