''' 
Задание: 
Вам доступен архив workbook.zip, содержащий различные папки и файлы. 
Напишите программу, которая выводит названия файлов из этого архива, которые были созданы или изменены позднее 2021-11-30 14:22:00. 
Названия файлов должны быть расположены в лексикографическом порядке, каждое на отдельной строке.

Примечание 1. Если файл находится в папке, вывести следует только название без пути.
Примечание 2. Начальная часть ответа выглядит так:

countries.json
data_sample.csv
...

От: 3 ноября 2023 г.
'''

from zipfile import ZipFile
from datetime import datetime

with ZipFile('workbook.zip') as zip_file:
    info_file = zip_file.infolist()
    date = (2021, 11, 30, 14, 22, 0)
    info_date = list(filter(lambda x: x.date_time >= date \
                            and x.is_dir() == False, info_file))
    
    
    for info in sorted(info_date, key=lambda x: (x.filename).split('/')[-1]):
      print(f'{(info.filename).split("/")[-1]}')

      
      
      
      
      
      
      
  

  
  





































