''' 
Задание: 
Вам доступен архив workbook.zip, содержащий различные папки и файлы. Напишите программу, которая выводит суммарный объем файлов этого архива в сжатом и не сжатом видах в байтах, в следующем формате:

Объем исходных файлов: <объем до сжатия> байт(а)
Объем сжатых файлов: <объем после сжатия> байт(а)

От: 3 ноября 2023 г.
'''

from zipfile import ZipFile

with ZipFile('workbook.zip') as zip_file:
    info_file = zip_file.infolist()
    sum_file_size = sum(x.file_size for x in info_file), sum(x.compress_size for x in info_file)
    print(f'Объем исходных файлов: {sum_file_size[0]} байт(а)\nОбъем сжатых файлов: {sum_file_size[1]} байт(а)')
      
      
      
      
      
      
      
      
  

  
  





































