''' 
Задание: 
Вам доступен архив workbook.zip, содержащий различные папки и файлы. 
Напишите программу, которая выводит названия всех файлов из этого архива в лексикографическом порядке, указывая для каждого его дату изменения, а также объем до и после сжатия, в следующем формате:

<название файла>
  Дата модификации файла: <дата изменения>
  Объем исходного файла: <объем до сжатия> байт(а)
  Объем сжатого файла: <объем после сжатия> байт(а)
Между данными о двух файлах должна располагаться пустая строка.

Примечание 1. Если файл находится в папке, вывести следует только название без пути.
Примечание 2. Начальная часть ответа выглядит так (в качестве отступов используйте два пробела):

Alexandra Savior – Crying All the Time.mp3
  Дата модификации файла: 2021-11-30 13:27:02
  Объем исходного файла: 5057559 байт(а)
  Объем сжатого файла: 5051745 байт(а)

Hollow Knight Silksong.exe
  Дата модификации файла: 2013-08-22 08:20:06
  Объем исходного файла: 805992 байт(а)
  Объем сжатого файла: 494930 байт(а)

...

От: 7 ноября 2023 г.
'''

from zipfile import ZipFile
from datetime import datetime

with ZipFile('workbook.zip') as zip_file:
    info_file = zip_file.infolist()
    info_date = list(filter(lambda x: x.is_dir() == False, info_file))
        
    for info in sorted(info_date, key=lambda x: (x.filename).split('/')[-1]):
      print(f'{(info.filename).split("/")[-1]}')
      print(f'  Дата модификации файла: {datetime(*info.date_time).strftime("%Y-%m-%d %H:%M:%S")}')
      print(f'  Объем исходного файла: {info.file_size} байт(а)')
      print(f'  Объем сжатого файла: {info.compress_size} байт(а)', end='\n\n')

      
      
      
      
      
      
      
      
  

  
  





































