''' 
Задание: 
Вам доступен файл deniro.csv, каждый столбец которого содержит либо только числа, либо строковые значения:

Machete,2010,72
Marvin's Room,1996,80
Raging Bull,1980,97
...
Напишите программу, которая сортирует содержимое данного файла по указанному столбцу. 
Причем данные должны быть отсортированы в порядке возрастания чисел, если столбец содержит числа, и в лексикографическом порядке слов, если столбец содержит слова.

Формат входных данных
На вход программе подается натуральное число — номер столбца файла deniro.csv.

Формат выходных данных
Программа должна отсортировать содержимое файла deniro.csv по введенному столбцу и вывести полученный результат в исходном формате.

Примечание 1. Нумерация столбцов начинается с единицы.
Примечание 2. Например, если бы файл deniro.csv имел вид:
red,4
blue,3
green,28
purple,1
и его требовалось отсортировать по второму столбцу (в порядке возрастания чисел), то программа должна была бы вывести:
purple,1
blue,3
red,4
green,28
Примечание 3. Если две какие-либо строки имеют одинаковые значения в столбцах, то следует сохранить их исходный порядок следования.
Примечание 4. Разделителем в файле deniro.csv является запятая, при этом кавычки не используются.

От: 27 октября 2023 г. в 14:44
'''

import csv

with open('deniro.csv', 'r', encoding='utf-8') as csv_file:
  rows = list(csv.reader(csv_file, delimiter=','))
  num_sorted = int(input())
  if num_sorted == 1:
    sorted_rows = sorted(rows, key= lambda item: item[num_sorted - 1])
  else:
    sorted_rows = sorted(rows, key= lambda item: int(item[num_sorted - 1]))
  
for line in sorted_rows:
  print(*line, sep=',')






































