''' 
Задание: 
Вам доступен файл salary_data.csv, который содержит анонимную информацию о зарплатах сотрудников в различных компаниях. 
В первом столбце записано название компании, а во втором — зарплата очередного сотрудника:

company_name;salary
Atos;135000
ХайТэк;24400
Philax;128600
Инлайн Груп;43900
IBS;70600
Oracle;131600
Atos;91000
...
Напишите программу, которая упорядочивает компании по возрастанию средней зарплаты ее сотрудников и выводит их названия, каждое на отдельной строке. 
Если две компании имеют одинаковые средние зарплаты, они должны быть расположены в лексикографическом порядке их названий.

Примечание 1. Средняя зарплата компании определяется как отношение суммы всех зарплат к их количеству.
Примечание 2. Разделителем в файле salary_data.csv является точка с запятой, при этом кавычки не используются.

От: 27 октября 2023 г. в 13:17
'''

import csv

with open('salary_data.csv', 'r', encoding='utf-8') as csv_file:
  rows = list(csv.DictReader(csv_file, delimiter=';'))
  dict_sum_elem = {}
  dict_salary = {}
  for row in rows:
    dict_sum_elem[row['company_name']] = dict_sum_elem.get(row['company_name'], 0) + 1
    dict_salary[row['company_name']] = dict_salary.get(row['company_name'], 0) + int(row['salary'])

dict_average_salary = {key: dict_salary[key] // dict_sum_elem[key] for key, value in dict_salary.items()}
for key in sorted(dict_average_salary, key= dict_average_salary.get):
  print(key)





































