"""
Дартс
Будем считать, что игровое поле для игры в дартс представляет собой квадратную матрицу, заполненную натуральными
числами, расположенными в порядке возрастания от краев к центру. Стороной игрового поля будем называть сторону
квадратной матрицы, которую представляет это поле.

Напишите программу, которая создает поле для игры в дартс определенного размера.
"""

n = int(input())

matrix = []
for i in range(n):
    matrix.append([1 for i in range(n)])

if n >= 3:
    len_el = n
    for i in range(n):
        for j in range(n):
            if i == j and i != 0:
                len_el -= 2
                k = n - i
                for m in range(i, k):
                    matrix[m][i:k] = [i + 1 for _ in range(len_el)]

for elem in matrix:
    print(*elem)