"""
Ќазовем скобочной последовательностью строку, состо€щую из символов ( и ). Ѕудем считать скобочную последовательность правильной, если:

дл€ каждой открывающей скобки есть закрывающа€ скобка
скобки закрываютс€ в правильном пор€дке, то есть в каждой паре из открывающей и закрывающей скобок открывающа€ находитс€ левее
Ќапишите программу, котора€ определ€ет, €вл€етс€ ли скобочна€ последовательность правильной.

‘ормат входных данных
Ќа вход программе подаетс€ строка, представл€юща€ собой скобочную последовательность.

‘ормат выходных данных
ѕрограмма должна вывести True, если введенна€ скобочна€ последовательность €вл€етс€ правильной, или False в противном случае.
"""

text = input()

open_sym, close_sym = 0, 0
def open_close_sym(text):
    sym = list(map(lambda x: 1 if x == '(' else -1, text))
    check = 0
    for elem in sym:
        if check < 0:
            return False
        else:
            check += elem
    if check == 0:
        return True
    else:
        return False
print(open_close_sym(text))