''' 
Задание: 
Напишите программу, которая принимает на вход последовательность дат и проверяет каждую из них на корректность.

Формат входных данных
На вход программе подается последовательность дат в формате DD.MM.YYYY, каждая на отдельной строке. Концом последовательности является слово end.

Формат выходных данных
Программа должна для каждой введенной даты вывести текст Корректная или Некорректная в зависимости от того, является ли дата корректной, а затем вывести количество корректных дат.

Примечание 1. Для анализа даты на корректность можете использовать уже реализованную функцию is_correct() из предыдущей задачи.

От: 22 сентября 2023 г. в 11:37
'''

from datetime import date

def is_correct(day, month, year):
    try:
        is_correct_date = date(year, month, day)
        return True
    except:
        return False

input_date = input()
date_correct = 0
        
while input_date != 'end':
    day, month, year = input_date.split('.')
    my_date = is_correct(int(day), int(month), int(year))
    if my_date:
        print('Корректная')
        date_correct += 1
    else:
        print('Некорректная')
    input_date = input()
    
print(date_correct)



    
   











































